Repository: 84000/data-translation-memory
Catalog: toh112-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་ཏེ།
en: Noble son, the Tathāgata Ratnagarbha congratulated the bodhisattva mahāsattva Mahākāruṇika: ‘Worthy being, it is excellent, excellent that your prayer for the conduct of enlightenment is such!

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཇི་ལྟར་སྔོན་དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་རྩེ་འཛིན་གྱིས་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་འོད་ཟེར་གྱི་སྤྱན་སྔར་དང་པོ་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་སྨོན་ལམ་འདི་ལྟ་བུ་བཏབ་སྟེ།
en: It is just like the prayer for bodhisattva conduct made by the Tathāgata Meruśikhariṃdhara, when he first developed the aspiration for enlightenment in the presence of the Tathāgata Lokeśvarajyotiṣa, and just as he had prayed, he performed such bodhisattva conduct.

source: སྐྱེས་བུ་དམ་པ་དེས་སྨོན་ལམ་ཇི་ལྟར་བཏབ་པ་དེ་བཞིན་དུ་བསྐལ་པ་ཆེན་པོ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ལས་ཤིན་ཏུ་ལྷག་པ་དེ་སྙེད་དུ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་སྤྱད་ནས། འདི་ནས་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་བྱེ་བ་ཕྲག་འབུམ་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཟེར་སོ་སོར་རྟོག་པ་ཞེས་བྱ་བར་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པའི་ནང་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཏེ།
en: After far more eons than there are grains of sand in the Ganges River, that worthy being attained the highest, most complete enlightenment of perfect buddhahood in the eastern direction from here, beyond a trillion buddha realms, in the world realm Jvālapratisaṃkhyā, where the lifespan is a hundred years.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡེ་ཤེས་མེ་ཏོག་རྡུལ་བྲལ་བྱང་ཆུབ་དབང་ཕྱུག་ཡང་དག་མཐོ་ཞེས་བྱ་བ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་བར་དུ་གྱུར་ཅིང་།
en: He became a tathāgata arhat samyaksam­buddha, and so on, up to and including a bhagavat buddha, named Jñāna­kusumavi­raja­samucchraya­bodhīśvara.

source: ལོ་བཞི་བཅུ་རྩ་ལྔར་སངས་རྒྱས་ཀྱི་མཛད་པ་མཛད་ནས་ཕུང་པོ་ལྷག་མ་མེད་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཞུགས་སོ།
en: He accomplished the activity of a buddha for forty-five years and then entered the state of nirvāṇa without any remaining aggregates. “ ‘

source: །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མེ་ཏོག་རྡུལ་བྲལ་བྱང་ཆུབ་དབང་ཕྱུག་ཡང་དག་མཐོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་དེའི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་ནི་ལོ་སྟོང་དུ་གནས་པར་གྱུར་ཏོ།
en: Mahākāruṇika, after Jñāna­kusumavi­raja­samucchraya­bodhīśvara passed into parinirvāṇa, the true Dharma remained for a thousand years.

source: །དམ་པའི་ཆོས་ནུབ་ནས་དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་ཡང་ལོ་སྟོང་དུ་གནས་པར་གྱུར་ཏོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མེ་ཏོག་རྡུལ་བྲལ་བྱང་ཆུབ་དབང་ཕྱུག་ཡང་དག་མཐོ་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་དམ་པའི་ཆོས་ཀྱི་ཚུལ་དང་།
en: The true Dharma then having come to an end, the external image of the Dharma remained for a thousand years.

source: དམ་པའི་ཆོས་ཀྱི་གཟུགས་བརྙན་གནས་པ་ན་དགེ་སློང་དང་། དགེ་སློང་མ་གང་དག་ཚུལ་ཁྲིམས་འཆལ་པ། སྡིག་པའི་ཆོས་དང་ལྡན་པ། མི་འཐུན་པར་སྤྱོད་པ། མཆོད་རྟེན་གྱི་ནོར་འཕྲོག་པ། ངོ་ཚ་མེད་པ་རྣམས་དང་། ཆོས་ཀྱི་མཆོད་པ་གཅོད་པར་བྱེད་པ། ངོ་ཚ་མེད་པ་དང་འདྲེས་པ་རྣམས་དང་། ཕྱོགས་བཞིའི་དགེ་འདུན་དང་།
en: Mahākāruṇika, after the Tathāgata Jñāna­kusumavi­raja­samucchraya­bodhīśvara passed into parinirvāṇa, when the true Dharma and the external image of the Dharma remained, there were bhikṣus and bhikṣuṇīs who had incorrect conduct, bad qualities, and adverse conduct; who shamelessly stole wealth from stūpas; who appropriated offerings to the Dharma; who mixed with shameless people; and who appropriated the clothing, food, beds, seats, medicine, and necessities from the saṅghas in the four directions or from their own saṅgha as an individual’s property, either for their own use or to give them to householders. “ ‘

source: མངོན་དུ་གྱུར་པའི་དགེ་འདུན་རྣམས་ཀྱི་གོས་དང་། ཟས་དང་། མལ་ཆ་དང་། སྟན་དང་། ནད་ཀྱི་གསོས་སྨན་དང་།
en: However, Mahākāruṇika, everyone had been successively prophesied through the three yānas by the Tathāgata Jñāna­kusumavi­raja­samucchraya­bodhīśvara.

source: ཡོ་བྱད་གཅོད་ཅིང་གང་ཟག་གིར་ཡོངས་སུ་བཟུང་སྟེ། བདག་སྤྱོད་པར་བྱེད་པའམ། ཁྱིམ་པ་ལ་སྦྱིན་པར་བྱེད་པ་ཐམས་ཅད་ཀྱང་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་མེ་ཏོག་རྡུལ་བྲལ་བྱང་ཆུབ་དབང་ཕྱུག་ཡང་དག་མཐོ་དེས་ཐེག་པ་གསུམ་པོ་དག་གིས་རིམ་གྱིས་ལུང་བསྟན་ཏོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་གང་སུ་དག་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་ངུར་སྨྲིག་དམར་པོ་བགོས་པ་ཐམས་ཅད་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་ཏོ།
en: Mahākāruṇika, all those who wore the red or orange robes in that bhagavat’s order had been prophesied to progress irreversibly in the three yānas.

source: །དགེ་སློང་ངམ། དགེ་སློང་མའམ། དགེ་བསྙེན་ནམ། དགེ་བསྙེན་མ་གང་སུ་དག་སྔ་མ་ཁོ་ན་བཞིན་དུ་ལྟུང་བའི་རྩ་བ་བྱུང་བར་གྱུར་པ་དེ་དག་ཀྱང་སྟོན་པར་འདུ་ཤེས་པའི་དགེ་བའི་རྩ་བའི་རྣམ་པར་སྨིན་པ་ཡོད་པས་དེ་བཞིན་གཤེགས་པ་དེས་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་པ་དེ་བཞིན་དུ་སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱིས་ཀྱང་བྱང་ཆུབ་ཀྱི་སྤྱོད་པའི་སྨོན་ལམ་བཏབ་པ་ལེགས་སོ་ལེགས་སོ།
en: Even those bhikṣus, bhikṣuṇīs, upāsakas, and upāsikās who had previously committed the root downfalls were prophesied to be irreversible along the three yānas, because of the ripening of the good roots of perceiving that tathāgata as their teacher.’ “

source: །རིགས་ཀྱི་བུ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གི་སྨོན་ལམ་ནི་འདི་ལྟ་བུ་ལགས་ཏེ། ཇི་སྲིད་དུ་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་སྤྱད་པ་སྤྱོད་པ་ནས། བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་པའི་སྤྱད་པ་སྤྱོད་པའི་བར་དུ་བདག་གིས་སེམས་ཅན་གང་དག་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་བར་ལ་སྦྱོར་བར་འགྱུར་བ་དང་།
en: Furthermore, noble son, the bodhisattva mahāsattva Mahākāruṇika said in front of the Tathāgata Ratnagarbha, ‘Bhadanta Bhagavat, my prayer is like this: For as long as I am practicing the conduct that leads to the highest enlightenment, may I enjoin beings to the perfection of generosity, make them enter it and be established in it, and so on, up to and including the perfection of wisdom.

source: ཡང་དག་པར་འཛིན་དུ་སྩོལ་བར་འགྱུར་བ་དང་།
en: May I enjoin them to good actions even as small as a hair tip.

source: རབ་ཏུ་འགོད་པར་འགྱུར་བའམ། ཐ་ན་དགེ་བའི་རྩ་བ་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་ཀྱི་ཚད་ཙམ་ལ་སྦྱོར་བར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ལས་སེམས་ཅན་འགའ་ཙམ་ཞིག་བདག་གིས་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པའི་ས་ལ་བཀོད་པར་མ་གྱུར་ན། བདག་གིས་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་དཔག་ཏུ་མ་མཆིས་གྲངས་མ་མཆིས་པ་དག་ན་བཞུགས་ཏེ། འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བསླུས་པར་གྱུར་ཅིག །
en: If, as I am practicing the conduct of enlightenment, I do not establish those beings in the irreversible stage along the three yānas—even just a single being—then I will have broken my promise to the bhagavat buddhas who reside, live, and remain in countless, innumerable realms in the ten directions, teaching the Dharma.

source: བདག་ཀྱང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མ་གྱུར་ཅིག །
en: May I then not attain the complete enlightenment of unsurpassable, perfect buddhahood. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་གིས་བླ་ན་མེད་པའི་ཡེ་ཤེས་ཐོབ་ནས་ཀྱང་སེམས་ཅན་གང་དག་བདག་གིས་བསྟན་པ་ལ་ཆོས་གོས་ངུར་སྨྲིག་བགོས་པར་གྱུར་པ་ལས་ལྟུང་བའི་རྩ་བ་བྱུང་བར་གྱུར་པའམ། ཉོན་མོངས་པ་ཅན་གྱི་ལྟ་བ་ལ་ཞུགས་པར་གྱུར་པའམ། དཀོན་མཆོག་གསུམ་ལ་འཁྲུལ་པར་གྱུར་ཅིང་། ནོངས་པ་དང་བཅས་པར་གྱུར་པའི་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་། དགེ་བསྙེན་མ་གང་དག་སྐད་ཅིག་གཅིག་ཙམ་བདག་ལ་སྟོན་པའི་འདུ་ཤེས་སམ།
en: Bhadanta Bhagavat, when I have attained unsurpassable wisdom, those beings who are clothed in the red or orange robes in my teaching, if they have committed root downfalls, have adopted bad views, or are mistaken about the Three Jewels and have committed transgressions, when they even for an instant have perceived me as their teacher or respected me, or respected the Dharma or the saṅgha, then, Bhadanta Bhagavat, if I do not give them the prophecy of irreversibility through the three yānas—even if I were to leave out a single being—then I will have broken my promise to the bhagavat buddhas.

source: གུས་པའི་སེམས་བསྐྱེད་པར་གྱུར་པའི་སེམས་ཅན་དེ་དག་ལས་བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་ཐ་ན་སེམས་ཅན་འགའ་ཙམ་ཞིག་སྤངས་ཤིང་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པར་ལུང་བསྟན་པར་མ་གྱུར་ན་བདག་གིས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བསླུས་པར་འགྱུར་བ་ནས་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་བའི་བར་དུ་གྱུར་ཅིག །
en: May I then not attain the complete enlightenment of unsurpassable, perfect buddhahood. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་བྱང་ཆུབ་ཐོབ་པའི་ཆོས་གོས་ངུར་སྨྲིག་དམར་པོ་ལྷ་དང་མི་རྣམས་ཀྱིས་གུས་པར་བགྱིས་པ་དང་། བླ་མར་བགྱིས་པ་དང་། རི་མོར་བགྱིས་པ་དང་།
en: Bhadanta Bhagavat, when I have attained enlightenment, may devas and humans respect, worship, honor, and make offerings to my red and orange robes.

source: མཆོད་པར་བགྱིས་པར་འགྱུར་བ་མཐོང་མ་ཐག་ཏུ་ངུར་སྨྲིག་མགུལ་ན་ཐོགས་པར་འགྱུར་བའི་སེམས་ཅན་རྣམས་ཀྱང་ཐེག་པ་གསུམ་པོ་དག་གིས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །སེམས་ཅན་གང་དག་བཟའ་བ་དང་།
en: When they see orange robes about my neck, may they attain irreversibility in the three yānas.

source: བཏུང་བ་དང་བྲལ་ཞིང་བཀྲེས་པ་དང་། སྐོམ་པས་གནོད་པར་གྱུར་པ་རྣམས་དང་། ཐ་ན་གནོད་སྦྱིན་དབུལ་པོ་རྣམས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་གང་དག་ཐ་ན་ཆོས་གོས་ངུར་སྨྲིག་སོར་བཞི་ཙམ་འཚལ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་བཟའ་བ་དང་། བཏུང་བ་ཕུན་སུམ་ཚོགས་པར་འགྱུར་ཞིང་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་གྱུར་ཅིག །ལྷའམ། གནོད་སྦྱིན་ནམ། སྲིན་པོའམ། ཀླུའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མིའམ་ཅིའམ། ལྟོ་འཕྱེ་ཆེན་པོའམ། གྲུལ་བུམ་འམ། ཤ་ཟའམ། མིའམ། སེམས་ཅན་གང་དག་ཕན་ཚུན་ཞེ་འགྲས་ཤིང་འཁོན་གཅུགས་མང་པོར་གྱུར་པ་རྣམས་དང་། ཕན་ཚུན་འགྱེད་ཅིང་གཡུལ་ངོར་ཞུགས་ཏེ།
en: May those beings, even poor yakṣas or the beings in Yama’s realm, who have no food or drink, who are hungry and thirsty, who long for even just four finger-widths of an orange dharma robe, all obtain excellent food and drink and have their wishes fulfilled. “ ‘

source: གཡུལ་སྤྲོད་པར་གྱུར་པ་རྣམས་ཀྱིས་ཀྱང་བདག་གི་ཆོས་གོས་ངུར་སྨྲིག་རྗེས་སུ་དྲན་པར་གྱུར་ན། སེམས་ཅན་དེ་དག་སྙིང་རྗེའི་སེམས་དང་། འཇམ་པའི་སེམས་དང་། ཁོ་ན་མེད་པའི་སེམས་དང་ལས་སུ་རུང་བའི་སེམས་སུ་གྱུར་ཅིག །སེམས་ཅན་གང་དག་གཡུལ་ངོའམ། འགྱེད་པའམ།
en: May those beings who are frequently hostile and vengeful toward each other and go to war with each other—whether devas, yakṣas, rākṣasas, nāgas, asuras, garuḍas, kinnaras, mahoragas, kumbhāṇḍas, piśācas, or humans—become compassionate, gentle, forgiving, and skillful when they remember my orange Dharma robes. “ ‘

source: འཐབ་པའམ། རྩོད་པའི་ནང་དུ་བསྲུང་བ་དང་། མཆོད་པར་བགྱི་བ་དང་། གུས་པར་བགྱི་བའི་སླད་དུ་ངུར་སྨྲིག་གི་དུམ་བུ་འཆང་བར་འགྱུར་བའི་སེམས་ཅན་དེ་དག་ཀྱང་རྟག་ཏུ་རྒྱལ་བར་འགྱུར་བ་དང་། འཁྲུལ་པ་མ་མཆིས་པ་དང་། རྣམ་པར་འཚེ་བ་མ་མཆིས་པར་གྱུར་ཅིག །གཡུལ་ངོ་དང་།
en: When beings who, in the midst of battles, arguments, wars, and fighting, obtain a piece of an orange robe in order to protect it, make offerings to it, and honor it, may those beings always be victorious, may they never make a mistake and never be injured, and may they have the good fortune to be freed from battles, arguments, wars, and fighting. “ ‘

source: འགྱེད་པ་དང་། ཐབ་མོ་དང་། རྩོད་པ་དེ་དག་ལས་ཀྱང་ལེགས་པར་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག །བཙུན་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གི་ཆོས་གོས་ངུར་སྨྲིག་དམར་པོ་འཕགས་པའི་ཡོན་ཏན་ལྔ་པོ་དེ་དག་དང་ལྡན་པར་མ་གྱུར་ན། བདག་གིས་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་བསླུས་པར་འགྱུར་བ་ནས།
en: Bhadanta Bhagavat, if my red and orange robes do not have these five noble qualities, then I will have broken my promise to the bhagavat buddhas.

source: བདག་གིས་སངས་རྒྱས་ཀྱི་མཛད་པ་མཐའ་དག་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པར་རྔོ་མི་ཐོགས་པ་དང་། བདག་གིས་ཆོས་རྣམས་བསྐྱུད་པར་འགྱུར་བ་དང་། བདག་གིས་གཞན་མུ་སྟེགས་ཅན་རྣམས་ཚར་གཅོད་པར་རྔོ་མི་ཐོགས་པའི་བར་དུ་གྱུར་ཅིག །
en: May I then not be able to accomplish the entire activity of a buddha, may I forget the Dharma, and may I not be able to overcome opposing tīrthikas. “ ‘

source: བཙུན་པ་བཅོམ་ལྡན་འདས་གང་དག་བདག་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱི་བར་དུ་དེ་བཞིན་གཤེགས་པ་ཤཱཀྱ་ཐུབ་པ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་ཏུ་བརྗོད་ཅིང་ཕྱག་འཚལ་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ལས་ཀྱི་སྒྲིབ་པ་བས་པར་འགྱུར་ཞིང་། མཐར་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་བླ་ན་མེད་པས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་འགྱུར་ལགས་སོ།
en: Bhadanta Bhagavat, those beings who, after I have attained complete enlightenment and until my passing into parinirvāṇa, pay homage to me, saying the words “Homage to the Tathāgata Śākyamuni,” will have all their karmic obscurations extinguished, and in the end will enter parinirvāṇa through the unsurpassable parinirvāṇa of the Buddha.’ “

source: །རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་དེས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། ཕྱག་གི་མཐིལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པའི་མགོ་ལ་བྱུགས་ནས་བཀའ་སྩལ་པ།
en: Then, noble son, the Tathāgata Ratnagarbha extended his right hand, stroked the head of the bodhisattva mahāsattva Mahākāruṇika with the palm of his hand, and said, ‘Excellent, worthy being, excellent!

source: སྐྱེས་བུ་དམ་པ་ཁྱོད་ཀྱི་སྨོན་ལམ་ནི་དགེ་བ། བཟང་བ།
en: This prayer of yours is virtuous, good, and well considered!

source: རབ་ཏུ་གཏན་ལ་བབ་པ་ཡིན་ཏེ་ལེགས་སོ་ལེགས་སོ། །སྐྱེས་བུ་དམ་པ་ཁྱོད་ནི་དེ་བཞིན་དུ་འཕགས་པའི་ཡོན་ཏན་ལྔ་དང་ལྡན་པའི་ངུར་སྨྲིག་དམར་པོས་སེམས་ཅན་རྣམས་ཉེ་བར་འཚོ་བར་བྱེད་པར་འགྱུར་རོ།
en: Thus, worthy being, through those five noble qualities, your red and orange robes will be of sustenance to beings!’ “

source: །ཀྱེ་རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་དེ་བཞིན་གཤེགས་པས་བསོད་ནམས་ཀྱི་ཕྱག་སོར་རིང་པོས་ཡོངས་སུ་བཀབ་ཅིང་ཕྱག་གཡས་པ་འཇམ་ཞིང་གཞོན་པའི་མཐིལ་གྱིས་བྱུགས་པ་དང་། ལུང་བསྟན་ཅིང་ལེགས་སོ་ཞེས་བྱ་བ་བྱིན་པ་དེས་མཆོག་ཏུ་དགའ་ཞིང་རབ་ཏུ་དད་པ་སྐྱེས་ནས། ཚེ་ལོ་ཉི་ཤུ་ལོན་པ་ལྟ་བུའི་ཚད་ཙམ་དུ་གཞོན་ནུར་རེད་དོ། །རིགས་ཀྱི་བུ་གཞན་ཡང་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་དང་།
en: Dear noble son, the bodhisattva mahāsattva Mahākāruṇika was filled with joy to receive that prophecy and congratulations, and because of his faith, because of being covered by the meritorious, long fingers of the Tathāgata, because of the touch of the soft, youthful palm of his hand, he became transformed into a youth with the appearance of a twenty-year-old. “

source: ལྷ་དང་། དྲི་ཟ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པ་རྣམས་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལ་མཆོད་པའི་ལས་བྱ་བའི་ཕྱིར་བརྩོན་པར་གྱུར་ཅིང་།
en: Moreover, noble son, the entire assembly, along with the devas, gandharvas, humans, and asuras, applied themselves to making offerings to the bodhisattva mahāsattva Mahākāruṇika.

source: མེ་ཏོག་དང་རོལ་མོའི་སྒྲ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ལ་མཆོད་པ་བྱས་ཏེ། བསྔགས་པ་དང་། ཚིགས་སུ་བཅད་པ་སྣ་ཚོགས་ཀྱིས་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ་འཁོད་དོ།
en: They made offerings of flowers and music to the bodhisattva mahāsattva Mahākāruṇika, praised him with various eulogies and verses, and remained there with palms placed together in homage.”

source: །ཐེག་པ་ཆེན་པོའི་མདོ་སྙིང་རྗེ་པད་མ་དཀར་པོ་ལས་ལུང་བསྟན་པའི་ལེའུ་ཞེས་བྱ་སྟེ་བཞི་པའོ།། །།
en: That concludes “The Prophecies to the Bodhisattvas,” which is the fourth chapter of the Mahāyāna sūtra titled The White Lotus of Compassion.

source: བམ་པོ་བཅུ་གསུམ་པ། རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེས་ཡང་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་ཞབས་ལ་ཡན་ལག་ལྔས་ཕྱག་བྱས་ཏེ།
en: The Practice of Generosity Chapter 5 “Noble son, the bodhisattva mahāsattva Mahākāruṇika bowed down the five points of his body to the feet of the Tathāgata Ratnagarbha.

source: དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོའི་སྤྱན་སྔར་འདུག་ནས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེའི་སྙིང་པོ་ལ་གུས་པ་དང་བཅས་པས་ཡོངས་སུ་ཞུས་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་དང་། ཚོགས་རྣམ་པར་དག་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་བསྟན་ལགས་ན།
en: He then sat down in front of the Tathāgata Ratnagarbha and respectfully addressed this question to the Tathāgata Ratnagarbha: ‘Bhadanta Bhagavat, you have taught the path of bodhisattvas, the Dharma discourse on the entranceway instruction to samādhi and the entranceway to the purity of accumulations.

source: བཙུན་པ་བཅོམ་ལྡན་འདས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལམ་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་དང་། ཚོགས་རྣམ་པར་དག་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་བསྟན་པ།
en: Bhadanta Bhagavat, how much have you taught of the path of bodhisattvas, the Dharma discourse on the entranceway instruction to samādhi and the entranceway to the purity of accumulations?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་དང་། ཚོགས་རྣམ་པར་དག་པའི་སྒོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ལགས།
en: Bhadanta Bhagavat, what is the complete extent of the teaching on samādhi entranceways and the Dharma discourse on pure accumulations?

source: བཙུན་པ་བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་ཚོགས་ཇི་ལྟ་བུ་དང་ལྡན་ན་བསྟན་པར་གནས་པ་ལགས།
en: Bhadanta Bhagavat, how should a noble son or noble daughter remain within your teaching?

source: ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྟན་པ་ཇི་ལྟ་བུས་ནི་བརྒྱན་པ་ལགས།
en: In what way should they be adorned by the teaching on samādhi entranceways?’ “

source: རིགས་ཀྱི་བུ་དེ་ནས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེའི་སྙིང་པོས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then, noble son, the tathāgata arhat samyaksam­buddha Ratnagarbha said to the bodhisattva mahāsattva Mahākāruṇika, ‘Excellent, Mahākāruṇika, excellent!

source: །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་ཀྱི་ཞུ་བ་བཟང་པོ་སྤོབས་པ་དགེ་སྟེ།
en: Your questions are good, your eloquence is virtuous.

source: སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་ལ་དོན་དེ་ལྟ་བུ་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ནི་སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་ཁྱོད་སེམས་ཅན་དཔག་ཏུ་མེད་གྲངས་མེད་པ་རྣམས་ལ་ཕན་པ་བྱེད་པ་དང་།
en: Mahākāruṇika, that you wish to ask the Tathāgata about this subject greatly benefits and is useful for countless, innumerable beings.

source: གཅེས་སྤྲས་བྱེད་པ་རྒྱ་ཆེན་པོ་སྐྱེས་པ་ཡིན་ཏེ། ལེགས་སོ་ལེགས་སོ། །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ།
en: Therefore, Mahākāruṇika, listen well and remember, for I shall explain. “ ‘

source: །སྙིང་རྗེ་ཆེན་པོ་དང་ལྡན་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཏིང་ངེ་འཛིན་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བ་ཡོད་དོ།
en: Mahākāruṇika, for bodhisattva mahāsattvas there is the samādhi called heroic course.

source: །བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་པ་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྗེས་སུ་ཞུགས་པ་ཡིན་ནོ།
en: The bodhisattva who remains in that samādhi is one who enters all samādhis.

source: །རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ། དེས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ཕྱག་རྒྱས་འདེབས་པར་བྱེད་དོ།
en: There is the samādhi called jewel seal, whereby all samādhis are sealed.

source: །སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཡོད་དེ། དེ་ལ་གནས་ནས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་རྩེ་བར་བྱེད་དོ།
en: There is the samādhi called lion’s play, abiding in which one can play with all samādhis.

source: །ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྣང་བར་བྱེད་དོ།
en: There is the samādhi called good moon, through which one illuminates all samādhis.

source: །ཟླ་བའི་རྒྱལ་མཚན་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་འཛིན་པར་བྱེད་དོ།
en: There is the samādhi called crest of the moon’s victory banner, through which one holds the victory banner of all samādhis.

source: །ཆོས་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱེད་དོ།
en: There is the samādhi called elevated above all phenomena, through which one realizes all samādhis.

source: །ཕྱག་རྒྱ་རྣམ་པར་ལྟ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱི་གཙུག་རྣམ་པར་ལྟ་བར་བྱེད་དོ།
en: There is the samādhi called beholding the seal, through which one beholds the crown of the head of all samādhis.

source: །ཆོས་ཀྱི་དབྱིངས་སུ་རྣམ་པར་སོང་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྣམ་པར་ངེས་པར་འགྲོ་བར་བྱེད་དོ།
en: There is the vanishing into the essence of phenomena samādhi, through which the bodhisattva rests in the essence of phenomena.

source: །ངེས་པའི་རྒྱལ་མཚན་ཏོག་གི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་འཛིན་པར་བྱེད་དོ།
en: There is the crest of the victory banner of certainty samādhi, through which one holds the victory banner of all samādhis.

source: །རྡོ་རྗེའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མི་ཕྱེད་པར་བྱེད་དོ།
en: There is the vajra samādhi, through which one does not distinguish between any samādhis.

source: །ཆོས་ལ་འཇུག་པའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ལ་ཕྱག་རྒྱས་འདེབས་པར་བྱེད་དོ།
en: There is the seal of entering the Dharma samādhi, through which one seals all Dharma teachings.

source: །ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ཤིན་ཏུ་བརྟན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྒྱལ་པོ་ཉིད་དུ་རབ་ཏུ་གནས་པར་བྱེད་དོ།
en: There is the being well-established as the king of samādhis samādhi, through which one becomes established as the king of all samādhis.

source: །འོད་ཟེར་འགྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འོད་ཟེར་འགྱེད་པར་བྱེད་དོ།
en: There is the radiating light rays samādhi, through which one radiates light rays onto all samādhis.

source: །སྟོབས་ཀྱི་བརྩོན་འགྲུས་ཀྱི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་སྟོབས་དང་བརྩོན་འགྲུས་སུ་བྱེད་དོ།
en: There is the diligence of strength samādhi, through which there is strength and diligence in all samādhis.

source: །ཡང་དག་པར་འཕགས་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལས་གྱེན་དུ་འཕགས་པར་བྱེད་དོ།
en: There is the fully ascended samādhi, through which one ascends in all samādhis.

source: །ངེས་པའི་ཚིག་སྟོན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཚིག་ལ་འཇུག་པར་བྱེད་དོ།
en: There is the revealing the meaning of words samādhi, through which one enters into the words for all samādhis.

source: །ཚིག་བླ་དགས་ལ་འཇུག་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་མིང་གི་རྗེས་སུ་འཇུག་པར་བྱེད་དོ།
en: There is the entering appellations samādhi, through which one enters into the names for all samādhis.

source: །ཕྱོགས་ལ་རྣམ་པར་ལྟ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྣམ་པར་ལྟ་བར་བྱེད་དོ།
en: There is the looking into the directions samādhi, through which one looks into all samādhis.

source: །ཆོས་ཐམས་ཅད་རབ་ཏུ་འབྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཆོས་ཐམས་ཅད་ཀྱིས་རབ་ཏུ་དབྱེ་བ་རྗེས་སུ་རྟོགས་པར་བྱེད་དོ།
en: There is the differentiating all phenomena samādhi, through which one penetrates the differentiation of all phenomena.

source: །ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་འཛིན་པར་བྱེད་དོ།
en: There is the retaining the seal samādhi, through which one possesses the seals of all samādhis.

source: །ཆོས་ཐམས་ཅད་ལ་དབེན་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལས་དབེན་པའི་ཆོས་ཉིད་ལ་རྗེས་སུ་འཇུག་པར་བྱེད་དོ།
en: There is the separation from all phenomena samādhi, through which one enters the true nature of that separation within all samādhis.

source: །བརྗེད་པ་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མི་བརྗེད་པར་བྱེད་དོ།
en: There is the never forgetting samādhi, through which one never forgets any samādhis.

source: །ཆོས་ཐམས་ཅད་ལས་མི་གཡོ་བའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་མི་གཡོ་བ་ཉིད་དུ་གནས་པར་བྱེད་དོ།
en: There is the not wavering from any Dharma samādhi, through which one remains unwavering within all samādhis.

source: །ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྡུད་ཅིང་ཡང་དག་པར་འདུ་བར་བྱེད་དོ།
en: There is the seal of the ocean gathering all phenomena samādhi, through which all samādhis are united and gathered.

source: །ཆོས་ཐམས་ཅད་ལ་རློམ་སེམས་མེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་འབྱུང་བ་དང་།
en: There is the absence of conceit concerning any phenomena samādhi, through which one has no conceit concerning the arising and entry into any samādhi.

source: འཇུག་པའི་རློམ་སེམས་མེད་པར་བྱེད་དོ། །ནམ་མཁའ་ཁྱབ་པར་བྱེད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་ནམ་མཁའ་ལྟར་ཁྱབ་པར་བྱེད་དོ།
en: There is the pervasion of space samādhi, through which one pervades, like space, all samādhis.

source: །ཆོས་ཐམས་ཅད་རྒྱུན་མི་གཅོད་པའི་ཏིང་ངེ་འཛིན་གྱིས་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྒྱུན་མི་འཆད་པར་བྱེད་དོ།
en: There is the uninterrupted continuity of all phenomena samādhi, through which there is the uninterrupted continuity of all samādhis.
